https://github.com/ajcr/100-pandas-puzzles/blob/master/100-pandas-puzzles-with-solutions.ipynb

In [2]:
import pandas as pd
import numpy as np

In [3]:
data = {'animal': ['cat', 'cat', 'snake', 'dog', 'dog', 'cat', 'snake', 'cat', 'dog', 'dog'],
        'age': [2.5, 3, 0.5, np.nan, 5, 2, 4.5, np.nan, 7, 3],
        'visits': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'priority': ['yes', 'yes', 'no', 'yes', 'no', 'no', 'no', 'yes', 'no', 'no']}

labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

4. Create a DataFrame df from this dictionary data which has the index labels.

In [7]:
df = pd.DataFrame(data)
df.index = labels
df

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no
d    dog  NaN       3      yes
e    dog  5.0       2       no
f    cat  2.0       3       no
g  snake  4.5       1       no
h    cat  NaN       1      yes
i    dog  7.0       2       no
j    dog  3.0       1       no

In [10]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
 #   Column    Non-Null Count  Dtype
---  ------    --------------  -----
 0   animal    10 non-null     object
 1   age       8 non-null      float64
 2   visits    10 non-null     int64
 3   priority  10 non-null     object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes

6. Return the first 3 rows of the DataFrame df.

In [12]:
df.iloc[:3]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
c  snake  0.5       2       no

In [14]:
## 7. Select just the 'animal' and 'age' columns from the DataFrame df.
df[["animal", "age"]]

  animal  age
a    cat  2.5
b    cat  3.0
c  snake  0.5
d    dog  NaN
e    dog  5.0
f    cat  2.0
g  snake  4.5
h    cat  NaN
i    dog  7.0
j    dog  3.0

In [19]:
## 8. Select the data in rows [3, 4, 8] and in columns ['animal', 'age'].
# df.iloc[:3][["animal", "age"]]
# df.loc[df.index[[3, 4, 8]], ['animal', 'age']]
# df.loc[df.index[[3]]]

  animal  age  visits priority
d    dog  NaN       3      yes

In [21]:
## 9. Select only the rows where the number of visits is greater than 3.
df[df["visits"]>3]

Empty DataFrame
Columns: [animal, age, visits, priority]
Index: []

In [23]:
## 10. Select the rows where the age is missing, i.e. it is NaN.

df[df["age"].isnull()]

  animal  age  visits priority
d    dog  NaN       3      yes
h    cat  NaN       1      yes

In [25]:
## 11. Select the rows where the animal is a cat and the age is less than 3.

df[(df["animal"]=="cat") & (df["age"]<3)]

  animal  age  visits priority
a    cat  2.5       1      yes
f    cat  2.0       3       no

In [28]:
# 12. Select the rows the age is between 2 and 4 (inclusive).

df[df['age'].between(2, 4)]

  animal  age  visits priority
a    cat  2.5       1      yes
b    cat  3.0       3      yes
f    cat  2.0       3       no
j    dog  3.0       1       no

In [31]:
## 13. Change the age in row 'f' to 1.5.

df.loc["f", "age"] = 1.5
df.loc["f"]

animal      cat
age         1.5
visits        3
priority     no
Name: f, dtype: object

In [32]:
df['visits'].sum()

19

In [36]:
## 15. Calculate the mean age for each different animal in df.

df.groupby(["animal"])["age"].mean()

animal
cat      2.333333
dog      5.000000
snake    2.500000
Name: age, dtype: float64

In [37]:
## 16. Append a new row 'k' to df with your choice of values for each column. Then delete that row to return the original DataFrame.

df.loc['k'] = [5.5, 'dog', 'no', 2]
df = df.drop('k')

In [41]:
## 17. Count the number of each type of animal in df.

# df.groupby(["animal"])["animal"].count()
df['animal'].value_counts()

animal
cat      4
dog      4
snake    2
Name: count, dtype: int64

In [42]:
## 18. Sort df first by the values in the 'age' in decending order, then by the value in the 'visits' column in ascending order (so row i should be first, and row d should be last).

df.sort_values(by=['age', 'visits'], ascending=[False, True])

  animal  age visits priority
i    dog  7.0      2       no
e    dog  5.0      2       no
g  snake  4.5      1       no
j    dog  3.0      1       no
b    cat  3.0      3      yes
a    cat  2.5      1      yes
f    cat  1.5      3       no
c  snake  0.5      2       no
h    cat  NaN      1      yes
d    dog  NaN      3      yes

In [43]:
## 19. The 'priority' column contains the values 'yes' and 'no'. Replace this column with a column of boolean values: 'yes' should be True and 'no' should be False.

df['priority'] = df['priority'].map({'yes': True, 'no': False})

In [51]:
## 20. In the 'animal' column, change the 'snake' entries to 'python'.

# df[df["animal"] == "snake"].?
df.loc[df['animal'] == 'snake', 'animal'] = 'python'

In [52]:
## 21. For each animal type and each number of visits, find the mean age. In other words, each row is an animal, each column is a number of visits and the values are the mean ages (hint: use a pivot table).

df.pivot_table(index='animal', columns='visits', values='age', aggfunc='mean')

visits    1    2     3
animal
cat     2.5  NaN  2.25
dog     3.0  6.0   NaN
python  4.5  0.5   NaN

In [58]:
df = pd.DataFrame({'A': [1, 2, 2, 3, 4, 5, 5, 5, 6, 7, 7]})

## How do you filter out rows which contain the same integer as the row immediately above?

# df.loc[df['A'].shift() != df['A']]
# df["A"]
df["A"].shift()

0     NaN
1     1.0
2     2.0
3     2.0
4     3.0
5     4.0
6     5.0
7     5.0
8     5.0
9     6.0
10    7.0
Name: A, dtype: float64

In [72]:
## 23. Given a DataFrame of random numeric values:# this is a 5x3 DataFrame of float values
## how do you subtract the row mean from each element in the row?

df = pd.DataFrame(np.random.random(size=(5, 3))) 
# df - df.values.mean()
# df - df.mean(axis=1)
df - df.mean(axis=1).values.reshape(-1, 1)

          0         1         2
0 -0.119176  0.149998 -0.030822
1  0.246983 -0.206345 -0.040638
2  0.322410  0.012343 -0.334753
3 -0.177006 -0.233250  0.410256
4 -0.131723 -0.066136  0.197859

In [80]:
df = pd.DataFrame(np.random.random(size=(5, 10)), columns=list('abcdefghij'))
## Which column of numbers has the smallest sum? Return that column's label.

arr_sum = df.sum(axis=0)
print(arr_sum)
arr_sum.index[arr_sum.argsort()[0]]

a    1.536706
b    2.427178
c    2.739376
d    2.614202
e    1.658926
f    2.402726
g    2.323448
h    3.102784
i    2.105561
j    2.602240
dtype: float64

/var/folders/cm/hd1gpbg91x76bmrgbqt79hcm0000gn/T/ipykernel_15341/4128020218.py:6: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  arr_sum.index[arr_sum.argsort()[0]]

'a'

In [84]:
## 25. How do you count how many unique rows a DataFrame has (i.e. ignore all rows that are duplicates)?

df = pd.DataFrame(np.random.randint(0, 2, size=(10, 3)))
print(df.shape[0])
len(df.drop_duplicates(keep=False))

10

3

In [86]:
'''
26. In the cell below, you have a DataFrame df that consists of 10 columns of floating-point numbers. Exactly 5 entries in each row are NaN values.

For each row of the DataFrame, find the column which contains the third NaN value.

You should return a Series of column labels: e, c, d, h, d
'''
nan = np.nan
data = [[0.04,  nan,  nan, 0.25,  nan, 0.43, 0.71, 0.51,  nan,  nan],
        [ nan,  nan,  nan, 0.04, 0.76,  nan,  nan, 0.67, 0.76, 0.16],
        [ nan,  nan, 0.5 ,  nan, 0.31, 0.4 ,  nan,  nan, 0.24, 0.01],
        [0.49,  nan,  nan, 0.62, 0.73, 0.26, 0.85,  nan,  nan,  nan],
        [ nan,  nan, 0.41,  nan, 0.05,  nan, 0.61,  nan, 0.48, 0.68]]
columns = list('abcdefghij')

df = pd.DataFrame(data, columns=columns)

(df.isnull().cumsum(axis=1) == 3).idxmax(axis=1)

0    e
1    c
2    d
3    h
4    d
dtype: object

In [99]:
### For each group, find the sum of the three greatest values. You should end up with the answer as follows:

df = pd.DataFrame({'grps': list('aaabbcaabcccbbc'), 
                   'vals': [12,345,3,1,45,14,4,52,54,23,235,21,57,3,87]})

df.groupby('grps')['vals'].nlargest(3).index[:,0] ## .sum(level=0)

IndexError: too many indices for array: array is 1-dimensional, but 2 were indexed